Revit 2027 API
RevitAPIPostEventArgs.Status Property
 Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RevitAPIEventStatus Status { get; }
Public ReadOnly Property Status As RevitAPIEventStatus
	Get
public:
property RevitAPIEventStatus Status {
	RevitAPIEventStatus get ();
}
member Status : RevitAPIEventStatus with get
Property Value
RevitAPIEventStatus
See Also
Reference
RevitAPIPostEventArgs Class
Autodesk.Revit.DB.Events Namespace